---
kind: enumMember
id: F:Autodesk.Revit.DB.WorksetConfigurationOption.OpenLastViewed
enum: Autodesk.Revit.DB.WorksetConfigurationOption
source: html/2fe5f0c1-c4c7-ea97-541c-5ee61b397dce.htm
---
# Autodesk.Revit.DB.WorksetConfigurationOption.OpenLastViewed

Close all user-created worksets by default, but open last viewed worksets.